class AppTexts {
  static const String correctionNotice = '''
আসসালামু আলাইকুম!

অত্যন্ত দুঃখের সাথে জানাতে হচ্ছে যে, বইটিতে কিছু অসংগতি নজরে এসেছে।

বইটির ৫৭ নং পৃষ্ঠায় 'পরকালের বিষয়ে ঈমান' অনুচ্ছেদে সিরাত তথা জাহান্নামের উপর নির্মিত সেতু অতিক্রম বিষয়ে আলোচনা করতে গিয়ে মুনাফিকদের ব্যাপারে বলা হয়েছে "মুনাফিকদের আলো নিভে যাবে বিধায় তারা মুমিনদের আলোয় কিছুদূর পথ চলবে" কিন্তু বিষয়টি ভুল এবং সংশোধনের দাবি রাখে ।
তাই নতুন করে এভাবে লিখা হয়েছে "কিন্তু মুনাফিকরা মুমিনদের অনুসরণ করলেও তাদের আলো নিভে যাবে বিধায় তারা আটকে যাবে এবং তাদের ও মুমিনদের মাঝে প্রাচীর তুলে দেয়া হবে আর তারা জাহান্নামের সর্বনিম্ন স্তরে নিক্ষিপ্ত হবে" । 

এছাড়া ৫৭ নং পৃষ্ঠায় কিছু পরিবর্তন ও সংযোজন হয়েছে। যার কারণে এই পৃষ্ঠার কিছু লেখা পরের পৃষ্ঠায় চলে গিয়েছে।

আর ৮৮ নং পৃষ্ঠায় কতিপয় কাবিরহ গুনাহ সেখানে পরনিন্দা এর পরিবর্তে গীবত লেখা হয়েছে এবং কু- ধারণা করা এর পরিবর্তে লেখা হয়েছে অন্যের প্রতি কু- ধারণা প্রকাশ করা আর  বিশ্বাসঘাতকতা করা এর স্থলে লেখা হয়েছে চুক্তি ভঙ্গ করা। 

৯২ নং পৃষ্ঠায় কতিপয় সগিরহ গুনাহ সেখানে একসাথে একাধিক তালাক দেওয়া সেটা বাদ দিয়ে অন্যের প্রতি কু -ধারণা করা এটা লেখা হয়েছে আর পর নারীর দিকে তাকানো এর স্থলে চোখের যিনা এটা লেখা হয়েছে। আর বাস্তবতা এটাই যে কু- ধারনা করা এটা নফসের সগীরহ গুনাহ আর অন্যের ব্যাপারে কু- ধারণা প্রকাশ করা পরনিন্দার অন্তর্ভুক্ত সুতরাং এটা যদি বাস্তবতার সাথে মিলে যায় তাহলে তা গীবত আর যদি বাস্তবতার সাথে অমিল হয় তাহলে সেটা অপবাদের অন্তর্ভুক্ত। 

সবার প্রতি দেখে নেয়ার অনুরোধ রইল।
''';
}