class AppTexts {
  static const String correctionNotice = '''
আসসালামু আলাইকুম!
 প্রিয় সকল মু'মিন ভাই ও বোন! আল্লাহ তাআলার কিতাব ব্যতীত কোন গ্রন্থই ত্রুটিমুক্ত নয়। তাই অত্যন্ত দুঃখের সাথে জানাতে হচ্ছে যে, এসো ঈমান শিখি নামক বইটিতে বেশ কিছু অসংগতি নজরে এসেছে।

এমনকি বইটির ভূমিকায় উল্লেখিত আয়াত দুটির প্রথম আয়াতের প্রথম ওয়াও এর অনুবাদ আসেনি আর দ্বিতীয় আয়াতের ওয়াও এর অনুবাদও আসেনি । তবে সংশোধন করা হয়েছে। এছাড়া বইটিতে উল্লেখিত আয়াত ও হাদিসের মধ্যে অনেক স্থানেই দৃঢ়তা বোধক ও নিশ্চয়তা বোধক অব্যয় এবং ওয়াও, ফা এর অনুবাদ বাদ পড়ে গিয়েছে। তবে এগুলো যথাসম্ভব উদ্ধারের চেষ্টা করা হয়েছে। এক্ষেত্রে একটি কথা হল বইটি লেখার সময় ভাবানুবাদের পরিবর্তে আক্ষরিক অনুবাদের গুরুত্ব দেওয়া হয়েছিল।তবে যে ক্ষেত্রে আক্ষরিক অনুবাদ সম্ভব নয়, সে ক্ষেত্রে তো ভাবানুবাদ করতেই হবে এবং সেই বিবেচনায় কোন অব্যয় , শব্দ ও বাক্যের যদি আক্ষরিক অনুবাদ করা  সম্ভব হয় তখন ভাবানুবাদ করা অথবা‌ অনুবাদ বাদ পড়ে যাওয়া কিছুতেই উচিত নয়।

বইটির ৫৭ নং পৃষ্ঠায় 'পরকালের বিষয়ে ঈমান' অনুচ্ছেদে সিরাত তথা জাহান্নামের উপর নির্মিত সেতু অতিক্রম বিষয়ে আলোচনা করতে গিয়ে মুনাফিকদের ব্যাপারে বলা হয়েছে যে, মুনাফিকদের আলো নিভে যাবে বিধায় তারা মুমিনদের আলোয় কিছুদূর পথ চলবে । কিন্তু বিষয়টি ভুল এবং সংশোধনের দাবি রাখে । তাই নতুন করে এভাবে লিখা হয়েছে "কিন্তু মুনাফিকরা মুমিনদের অনুসরণ করলেও তাদের আলো নিভে যাবে বিধায় তারা আটকে যাবে এবং তাদের ও মুমিনদের মাঝে প্রাচীর তুলে দেয়া হবে আর তারা জাহান্নামের সর্বনিম্ন স্তরে নিক্ষিপ্ত হবে" । 

এছাড়া ৫৭ নং পৃষ্ঠায় কিছু পরিবর্তন ও সংযোজন হয়েছে। যার কারণে এই পৃষ্ঠার কিছু লেখা পরের পৃষ্ঠায় চলে গিয়েছে ।

আর ৮৪ নং পৃষ্ঠায় একটি হাদিস ভুলক্রমে তাবিয়ী(মুআবিয়া ইবনু কুররা)সূত্রে বর্ণনা করা হয়েছে অথচ তিনি তার পিতা অর্থাৎ সাহাবীর কাছ থেকে শুনেছেন হাদীসটি। তো সেটা সংশোধন করে দেওয়া হয়েছে। 

আর ৮৮ নং পৃষ্ঠায় কতিপয় কাবিরহ গুনাহ সেখানে পরনিন্দা এর পরিবর্তে গীবত লেখা হয়েছে। কু- ধারণা করা এর পরিবর্তে লেখা হয়েছে অন্যের প্রতি কু- ধারণা প্রকাশ করা এবং বিশ্বাসঘাতকতা করা এর স্থলে লেখা হয়েছে চুক্তি ভঙ্গ করা ।

আর ৯২ নং পৃষ্ঠায় কতিপয় সগিরহ গুনাহ সেখানে একসাথে একাধিক তালাক দেওয়া সেটা বাদ দিয়ে অন্যের প্রতি কু ধারণা ধারণা করা এটা লেখা হয়েছে আর পর নারীর দিকে তাকানো এখানে ভাষা পরিবর্তন করে চোখের যিনা এটা লেখা হয়েছে।

আর ১১৭ নং পৃষ্ঠায় মুরতাদ্দের বিধান আলোচনায় ময়দার দলা খাওয়ানোর বর্ণনা লেখা হয়েছে। যেহেতু সেটি আটা নাকি ময়দা সেটা জানা নেই তাই সেটা বর্জনীয় আর দ্বিতীয়ত রগীফ এটা খামিরের দলা আবার সেই দলা দিয়ে প্রস্তুত কৃত রুটিকেও বলা হয়, তাই রুটি অর্থ করা হয়েছে। 

আর ১৭১ ও ১৮৪ নং পৃষ্ঠায় উল্লেখিত সহীহ মুসলিমের হাদিসটিতে অর্থ ঠিক আছে তবে সহিহ মুসলিমের বর্ণনায় ওয়াও যুক্ত হয়নি কিন্তু বইয়ের আরবি বর্ণনায় উল্লেখে ওয়াও যুক্ত হয়েছে এই ওয়াও টা বাদ দিতে হবে।আর বাস্তবতা এটাই যে কু ধারনা করা এটা নফসের সগীরহ গুনাহ আর অন্যের ব্যাপারে কু ধারণা প্রকাশ করা পরনিন্দার অন্তর্ভুক্ত সুতরাং এটা যদি বাস্তবতার সাথে মিলে যায় তাহলে তা গীবত আর যদি বাস্তবতার সাথে অমিল হয় তাহলে সেটা অপবাদের অন্তর্ভুক্ত। আর যেহেতু পুরো বই সম্পাদনা হয়েছে তাই এতে অনেক সংশোধন ও সংযোজন হয়েছে। তবুও কুরআন ব্যতীত সকল গ্রন্থেই ভুল -ত্রুটি থেকে যাওয়া স্বাভাবিক।

আলহামদুলিল্লাহ অনুবাদের মান আগের চেয়ে উত্তম হয়েছে। বইয়ের পৃষ্ঠা সংখ্যা আগের মত ১৯২ অবস্থাতেই আছে তবে আল্লাহ তা'আলা চাইলে এর পরিমার্জিত সংস্করণ ছাপা হলে তা বৃদ্ধি পেতে পারে। যে পৃষ্ঠা গুলোতে পরিবর্তন-পরিবর্ধন হয়েছে নিচে সে পৃষ্ঠাগুলোর নম্বর দিয়ে দেওয়া হলো। ১৭, ২২,২৩, ২৬,২৭, ২৮, ২৯,৩০, ৩২, ৩৪,৩৫,৪৩,৪৪,৪৫,৪৬,৪৮,৪৯,৫০,৫১,৫৭,৬২,৬৫,৭০,৭৪,৭৫,৭৮,৮২,৮৪,৮৫,৮৬,৮৭,৮৮,৮৯,৯০,৯২,৯৪,৯৮,১০০,১০১,১০৩,১০৪,১০৬,১০৭,১০৮,১০৯,১১২,১১৫,১১৬,১১৭,১২০,১২১,১২২,১২৩,১২৮,১২৯,১৩১,১৩৭,১৩৮,১৩৯,১৪১,১৪৫,১৪৬,১৪৯,১৫২,১৫৩,১৫৬,১৬০,১৬২,১৬৩,১৬৬,১৬৯,১৭১,১৭৫,১৭৯,১৮৪,১৯১। আলহামদুলিল্লাহ বইটির অ্যাপ সংস্কার হয়ে গুগল প্লে স্টোরে নতুন করে আপডেট দেওয়া হয়েছে এবং ইনশাআল্লহ প্রকাশনা সংস্থা হতে পরিমার্জিত সংস্করণ নতুন করে ছাপা হবে। বইটি যাদের সংগ্রহে আছে এবং যারা বইটি যাদের কাছে প্রচার করেছেন তারা জ্ঞাত এবং অজ্ঞাত মহলে অনলাইনে- অফলাইনে ভুলগুলো প্রচার করে দিলেও ভালো হয় ।
''';
}