
import '../model/text_model.dart';

final List<TextModel> dataList = [
  TextModel(
    title: 'উৎসর্গ',
    arabic_title: '',
    show: true,
    translation: '',
    description:' ',
    reference: ' ',
  ),
  TextModel(
    title: 'লেখকের কথা',
    arabic_title: '',
    show: true,
    translation: '',
    description:' ',
    reference: ' ',
  ),
  TextModel(
    title: 'কালিমাতুন তইয়িবাহ',
    arabic_title: '(كلمة طيبة)',
    show: true,
    translation: 'আল্লাহ তা’আলার পক্ষ হতে নাবী- রসূলগণ আলাইহিমুস সালামের নিকট প্রেরিত এই দ্বীনের কালিমাহ্ বা মূল কথা হচ্ছে لا إله إلا الله যার অর্থ হলো ‘আল্লাহ ব্যতীত কোন ইলাহ নেই’। এটি ইসলামের মূল কালিমাহ্। অত্যন্ত গুরুত্বপূর্ণ ও মর্যাদাময় এই কালিমাহ্। এই কালিমাহ্ দীনে হাক্কের ভিত্তি। এই কালিমাহ্ হাক্ক-বাতিলের মানদণ্ড। সুতরাং তা ঈমান-কুফ্র, সত্য-মিথ্যার মাঝে পার্থক্য করে দেয়। এর রয়েছে গভীর অর্থ ও মর্ম। এর মাঝেই রয়েছে জীবন পরিচালনার মূল চাবিকাঠি। এই কালিমাহ’কে কালিমাতুন তইয়িবাহ (كلمة طيبة) বলে।\nআল্লাহ তা’আলা বলেন\nأَلَمْ تَرَ كَيْفَ ضَرَبَ اللهُ مَثَلًا كَلِمَةً طَيِّبَةً كَشَجَرَةٍ طَيِّبَةٍ أَصْلُهَا ثَابِتٌ وَفَرْعُهَا فِي السَّمَاءِ',
    description:' তুমি কি লক্ষ্য কর না আল্লাহ কিভাবে উপমা দিয়ে থাকেন পবিত্র বাণীর, যা উৎকৃষ্ট বৃক্ষের ন্যায়? এর মূল সুদৃঢ় আর এর শাখা রয়েছে ঊর্ধ্বে।[১]\nউপরোক্ত আয়াতের ব্যাখ্যায় আব্দুল্লহ ইবনু আব্বাস রদিয়াল্লহু আনহুসহ অন্যান্যদের হতে বর্ণনা রয়েছে যে, কালিমাতুন তইয়িবাহ বা পবিত্র বাণী হচ্ছে। لا إله إلا الله [২] ',
    reference: ' ১.সূরা ইবরহীম: ২৪\n২.তাফসীরে ত্ববারী, সূরা ইবরহীম: ২৪',
  ),

  TextModel(
    title: 'কালিমাতুন তইয়িবাহ’র নামকরণ',
    arabic_title: '',
    show: false,
    translation: 'كلمة (কালিমাহ্) শব্দের অর্থ: শব্দ, বাক্য, কথা বা বাণী।\n '
        'আর طيبة (তইয়িবা) শব্দের অর্থ : পবিত্র, উত্তম, উৎকৃষ্ট ও সৎ। তাই কালিমাতুন তইয়িবাহ’র অর্থ দাঁড়াচ্ছে- পবিত্র বাণী। এ বাণী মেনে নেওয়ার মাধ্যমেই র্শিক থেকে মুক্ত হয়ে মানুষ পবিত্র জীবনে প্রবেশ করতে পারে। তাই এর নামকরণ করা হয়েছে পবিত্র বাণী বা কালিমাতুন তইয়িবাহ্।',
    description:'',
    reference: '',
  ),
  TextModel(
    title: 'কালিমাতুত্-তাক্ওয়া',
    arabic_title: '(كلمة التقوي)',
    show: true,
    translation: 'কালিমাতুত্-তাক্ওয়া হচ্ছে\n لا إله إلا الله محمد رسول الله যার অর্থ হলো ‘আল্লাহ ব্যতীত কোন ইলাহ নেই এবং মুহাম্মাদ আল্লাহ’র রসূল।’\nআল্লাহ তা’আলা বলেন,\n'
  'اِذْ جَعَلَ الَّذِیْنَ كَفَرُوْا فِیْ قُلُوْبِهِمُ الْحَمِیَّةَ حَمِیَّةَ الْجَاهِلِیَّةِ فَاَنْزَلَ اللّٰهُ سَكِیْنَتَهٗ عَلٰی رَسُوْلِهٖ وَ عَلَی الْمُؤْمِنِیْنَ وَ اَلْزَمَهُمْ كَلِمَةَ التَّقْوٰی وَ كَانُوْۤا اَحَقَّ بِهَا وَ اَهْلَهَا ؕ وَ كَانَ اللّٰهُ بِكُل شَیْءٍ عَلِیْمًا۠ ۝۲۶                                         ',
    description:'যারা কুফর করেছে, তারা যখন তাদের অন্তরে গোড়ামির স্থান দিল- অজ্ঞতা যুগের গোড়ামি, তখন আল্লাহ তাঁর রসূল ও মু’মিনদের উপর স্বীয় প্রশান্তি বর্ষন করলেন এবং তাক্ওয়ার কালিমাহ’য় তাদের সূদৃঢ় করলেন আর তারা ছিল এর সর্বাধিক উপযুক্ত ও এর যোগ্য। আর আল্লাহ সকল বিষয়ে জ্ঞাত আছেন।[১]\n'
    'উপরোক্ত আয়াতের ব্যাখ্যায় আবু হুরাইরা রদিয়াল্লহু আনহু রসূল সল্লাল্লহু আলাইহি ওয়াসাল্লামের বরাতে বলেন,\n'
    'কালিমাতুত্-তাক্ওয়া হচ্ছে-\n                    [২] لا إله إلا الله محمد رسول الله' ,
    reference: '১. সূরা আল-ফাত্হ: ২৬\n২. আল-আসমা ওয়াস-সিফাত লিল বাইহাকী: ১৯৭-১৯৮ ',
  ),
  TextModel(
    title: 'কালিমাতুত্-তাক্ওয়ার নামকরণ',
    arabic_title: '',
    show: false,
    translation: 'كلمة (কালিমাহ্) শব্দের অর্থ ইতঃপূর্বে আলোচিত হয়েছে। আর التقوي (আত্-তাক্ওয়া) অর্থ : ভয় করা, বেঁচে থাকা, যাচাই-বাছাই করে চলা, বিরত থাকা, সতর্ক থাকা ও রক্ষা করা। সুতরাং কালিমাতুত্ তাক্ওয়ার অর্থ হচ্ছে- ভীতির বাণী বা আল্লাহ ভীতির বাণী। অতএব মানুষ যেহেতু এ বাণী গ্রহণ করতঃ আল্লাহ’র ভয়ে তাঁর ইবাদাত তথা বিধি-নিষেধ মেনে চলে এবং যাবতীয় অন্যায়-পাপাচার হতে নিজেকে বিরত-রক্ষা করে, তাই একে কালিমাতুত্-তাক্ওয়া নামকরণ করা হয়েছে। ',
    description:'আল্লাহ তা’আলা বলেন,\n'
'یٰۤاَیُّهَا النَّاسُ اعْبُدُوْا رَبَّكُمُ الَّذِیْ خَلَقَكُمْ وَ الَّذِیْنَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُوْنَۙ۝۲۱'
'\nহে মানবজাতি! তোমরা তোমাদের রব্বের ইবাদাত কর, যিনি তোমাদের ও তোমাদের পূর্ববর্তীদের সৃষ্টি করেছেন। যাতে তোমরা তাক্ওয়া অবলম্বন করতে পার।[১]\n'
'উল্লেখ্য, পূর্বোক্ত কালিমাতুন তইয়িবাহ এবং কালিমাতুত্-তাক্ওয়া আহলুস্ সুন্নাহ ওয়াল জামাআহ’র নিকট কালিমাতুত্-তাওহীদ \n(كلمة التوحيد) বা একত্ববাদের বাণী হিসেবেও পরিচিত। ',
    reference: ' ',
  ),
  TextModel(
    title: 'কালিমাতুশ্-শাহাদাহ্',
    arabic_title: '(كلمة الشهادة)',
    show: true,
    translation: 'কালিমাতুশ্-শাহাদাহ্ বলা হয় কোন ব্যক্তি এভাবে অভিব্যক্তি প্রকাশ করা-\n'
    '             أشهد أن لا إله إلا الله وأن محمدا رسول الله'
    '\nঅর্থ: আমি সাক্ষ্য দিচ্ছি যে,আল্লাহ ছাড়া কোন ইলাহ নেই এবং মুহাম্মাদ আল্লাহ’র রসূল।'
 ' রসূল সল্লাল্লহু আলাইহি ওয়াসাল্লাম বলেন\n'
  '           الإسلام أن تشهد أن لا إله إلا الله وأن محمدا رسول الله'
 ' \nঅর্থ : ইসলাম হলো- তুমি সাক্ষ্য প্রদান করবে যে, আল্লাহ ব্যতীত কোন ইলাহ নেই এবং মুহাম্মাদ আল্লাহ’র রসূল।[১] ',
    description:' ',
    reference: ' ১.সহীহ মুসলিম: ৮ ',
  ),
  TextModel(
    title: 'কালিমাতুশ-শাহাদাহ’র নামকরণ',
    arabic_title: '',
    show: false,
    translation: 'كلمة (কালিমাহ্) শব্দের অর্থ ইতঃপূর্বে আলোচিত হয়েছে। আর الشهادة (আশ্- শাহাদাহ্) অর্থ: সাক্ষ্য প্রদান, উপস্থিত থাকা, দৃশ্যমান, প্রকাশ্য। সুতরাং কালিমাতুশ-শাহাদাহ’র অর্থ হচ্ছে- সাক্ষ্য প্রদানের বাক্য।',
    description:'এই কালিমাহ’র সাক্ষ্য প্রদানের মাধ্যমেই মানুষ ইসলামে প্রবেশ করে, তাই এই কালিমাহ্ আহলুস্ সুন্নাহ ওয়াল জামাআহ’র নিকট কালিমাতুশ্ -শাহাদাহ্ (كلمة الشهادة) নামে পরিচিত।',
    reference: ' ',
  ),
  TextModel(
    title: 'কালিমাতুত-তাক্ওয়া বা কালিমাতুশ্-শাহাদাহ’র ব্যাখ্যা',
    arabic_title: '',
    show: false,
    translation: 'কালিমাহ’র দুটি অংশ রয়েছে। প্রথম অংশ لا إله إلا الله “লা ইলাহা ইল্লাল্লহ” আর দ্বিতীয় অংশ হচ্ছে محمد رسول الله “মুহাম্মাদুর রসূলুল্লহ”। প্রথম অংশের অর্থ হচ্ছে- আল্লাহ ছাড়া কোন ইলাহ্ নেই আর দ্বিতীয় অংশের অর্থ হচ্ছে- মুহাম্মাদ আল্লাহ’র রসূল। এ কালিমাহ’র প্রথম অংশে র্শিকের অন্ধকার থেকে মুক্ত হয়ে মানব জাতিকে এক ইলাহ তথা আল্লাহ’র ইবাদাতের একত্ববাদের আলোর দিকে আহবান জানানো হয়েছে আর দ্বিতীয় অংশে মুহাম্মাদ সল্লাল্লহু আলাইহি ওয়াসাল্লামকে আল্লাহ তা’আলার রসূল তথা প্রতিনিধি হিসেবে মানব জাতির জন্য পথপ্রদর্শক, উত্তম আদর্শ ও নেতা হিসেবে ঘোষণা করা হয়েছে।',
    description:' ',
    reference: ' ',
    referenceShow: false
  ),
  TextModel(
    title: 'ইলাহ্ কাকে বলে (কালিমাহ’র প্রথম অংশ)',
    arabic_title: '',
    show: false,
    translation: 'কালিমাহ’র প্রথম হচ্ছে لا إله إلا الله অর্থাৎ আল্লাহ ব্যতীত কোন ইলাহ নেই। সুতরাং কালিমাহ’র প্রথম অংশ সঠিক ভাবে বুঝে এর মর্মার্থ উপলব্ধি করতে হলে ইলাহ্ সম্পর্কে সুস্পষ্ট জ্ঞান থাকতে হবে।'
        'ইলাহ্ (إله) আরবী শব্দ, যার শাব্দিক অর্থ হচ্ছে- সার্বভৌম অর্থাৎ সর্বভূমির অধিকার বা সকল কর্তৃত্বের অধিকারী সত্তা। সুতরাং সার্বভৌমত্বের অধিকারী সত্তাকে সার্বভৌম বা ইলাহ্ বলা হয়। আর সার্বভৌমত্ব বলা হয় এমন সার্বজনীন চূড়ান্ত ক্ষমতা বা কর্তৃত্বকে, যার উপর কোন আপত্তি করা যায় না। সুতরাং সার্বভৌম সত্তা নিরংকুশ কর্তৃত্ব ভোগ করেন এবং তিনি প্রশ্নোর্ধ্ব ও আইনোর্ধ্ব থাকেন, আর এই সার্বভৌমত্ব একমাত্র বিশ্বজগতের স্রষ্টা মহান আল্লাহ’র। কেননা,\n '
        '১. তিনি বিশ্বজগতের সৃষ্টিকর্তা, তত্ত্বাবধায়ক ও প্রভুত্বের অধিকারী।\n'
    'আল্লাহ তা’আলা বলেন,\n'
  '  اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِیْنَۙ۝۱'
  '\nসমস্ত প্রশংসা বিশ্বজগতের প্রভূ আল্লাহ’র।[১]\n'
  'اَللّٰهُ خَالِقُ كُلِّ شَیْءٍ ؗ وَّ هُوَ عَلٰی كُلِّ شَیْءٍ وَّكِیْلٌ۝۶۲'
 ' আল্লাহ সর্বস্রষ্টা এবং সর্ব তত্ত্বাবধায়ক।[২]\n'
  'اَللّٰهُ الَّذِیْ خَلَقَكُمْ ثُمَّ رَزَقَكُمْ ثُمَّ یُمِیْتُكُمْ ثُمَّ یُحْیِیْكُمْ ؕ هَلْ مِنْ شُرَكَآىِٕكُمْ مَّنْ یَّفْعَلُ مِنْ ذٰلِكُمْ مِّنْ شَیْءٍ ؕ سُبْحٰنَهٗ وَ تَعٰلٰى عَمَّا یُشْرِكُوْنَ۠۝۴۰'
  '\nআল্লাহ, যিনি তোমাদের সৃষ্টি করেছেন এরপর তোমাদের জীবিকার ব্যবস্থা করেছেন অতঃপর তিনি তোমাদের মৃত্যু দিবেন এরপর তোমাদের পুনর্জীবন দান করবেন। তোমাদের শরীকদের কেউ কি এগুলোর কোন একটি করতে পারে? তারা যা শরীক করে, তা হতে তিনি পবিত্র এবং ঊর্ধ্বে।[৩]\n'
        '২. তিনি সকল নেতৃত্ব, কর্তৃত্ব ও ক্ষমতার অধিকারী।'
    'আল্লাহ তা’আলা বলেন,\n'
  'اِنِ الْحُكْمُ اِلَّا لِلّٰهِ ؕ اَمَرَ اَلَّا تَعْبُدُوْۤا اِلَّاۤ اِیَّاهُ ؕ ذٰلِكَ الدِّیْنُ الْقَیِّمُ وَ لٰكِنَّ اَكْثَرَ النَّاسِ لَا یَعْلَمُوْنَ۝۴۰'
  '\nবিধান একমাত্র আল্লাহ’র। তিনি নির্দেশ করেছেন যে, তিনি ছাড়া অন্য কারো ইবাদাত করো না। এটাই সরল পথ, কিন্তু অধিকাংশ মানুষ তা জ্ঞান করে না।[৪]\n'
  'اَلَمْ تَعْلَمْ اَنَّ اللّٰهَ لَهٗ مُلْكُ السَّمٰوٰتِ وَ الْاَرْضِ ؕ وَ مَا لَكُمْ مِّنْ دُوْنِ اللّٰهِ مِنْ وَّلِیٍّ وَّ لَا نَصِیْرٍ۝۱۰۷'
  '\nতুমি কি জানো না যে, আসমান ও জমিনের রাজত্ব একমাত্র আল্লাহ’র আর আল্লাহ ব্যতীত তোমাদের কোন অভিভাবক ও সাহায্যকারী নেই।[৫]\n'
  'وَ لِلّٰهِ مُلْكُ السَّمٰوٰتِ وَ الْاَرْضِ ؕ وَ اللّٰهُ عَلٰی كُلِّ شَیْءٍ قَدِیْرٌ۠۝۱۸۹'
  '\nআর আসমান ও জমিনের রাজত্ব একমাত্র আল্লাহ’র এবং তিনি সকল কিছুর উপর ক্ষমতাধিকারী।[৬]\n'
  'الَّذِیْ لَهٗ مُلْكُ السَّمٰوٰتِ وَ الْاَرْضِ وَ لَمْ یَتَّخِذْ وَلَدًا وَّ لَمْ یَكُنْ لَّهٗ شَرِیْكٌ فِی الْمُلْكِ وَ خَلَقَ كُلَّ شَیْءٍ فَقَدَّرَهٗ تَقْدِیْرًا۝۲'
  '\nযার রয়েছে আসমান ও জমিনের রাজত্ব, আর তিনি কোন সন্তান গ্রহণ করেননি এবং রাজত্বে তাঁর কোন শরীক নেই। আর তিনি সব কিছু সৃষ্টি করেছেন অতঃপর যথাযথভাবে এসবের ভাগ্য নির্ধারণ করেছেন।[৭]\n'
  'قُلِ اللّٰهُ خَالِقُ كُلِّ شَیْءٍ وَّ هُوَ الْوَاحِدُ الْقَهَّارُ۝۱۶'
  '\nআপনি বলুন, আল্লাহ সর্বস্রষ্টা আর তিনি একক, পরাক্রম।[৮]\n'
  'وَ هُوَ الْقَاهِرُ فَوْقَ عِبَادِهٖ ؕ وَ هُوَ الْحَكِیْمُ الْخَبِیْرُ۝۱۸'
  '\nআর তিনি তাঁর বান্দাদের উপর পরাক্রম এবং তিনি প্রজ্ঞাময়, সর্বজ্ঞ।[৯]\n'
  'اَلَا لَهُ الْخَلْقُ وَ الْاَمْرُ ؕ تَبٰرَكَ اللّٰهُ رَبُّ الْعٰلَمِیْنَ۝۵۴'
  '\nজেনে রাখ! সৃষ্টি এবং সিদ্ধান্ত একমাত্র তাঁর। আল্লাহ মহান, বিশ্বজগতের প্রতিপালক।[১০]\n'
  'فَسُبْحٰنَ الَّذِیْ بِیَدِهٖ مَلَكُوْتُ كُلِّ شَیْءٍ وَّ اِلَیْهِ تُرْجَعُوْنَ۠۝۸۳'
  '\nসুতরাং পবিত্রতা তাঁর, যার হাতে সর্বময় কর্তৃত্ব এবং তাঁরই কাছে তোমাদের প্রত্যাবর্তন করানো হবে।[১১]\n '
    '\n৩. তিনি আইনের উর্ধ্বে, প্রশ্নের উর্ধ্বে। তাঁর কোন সিদ্ধান্ত, আইন-নীতির বিরুদ্ধাচরণ ও আপত্তি করা যাবে না।\n'
   ' আল্লাহ তা’আলা বলেন,\n'
  'لَا یُسْـَٔلُ عَمَّا یَفْعَلُ وَ هُمْ یُسْـَٔلُوْنَ۝۲۳'
  '\nতিনি যা করেন, সে ব্যাপারে কোন প্রশ্ন করা যাবেনা আর সকলকেই প্রশ্নের সম্মুখীন হতে হবে।[১২]\n'
  'وَ مَا كَانَ لِمُؤْمِنٍ وَّ لَا مُؤْمِنَةٍ اِذَا قَضَی اللّٰهُ وَ رَسُوْلُهٗۤ اَمْرًا اَنْ یَّكُوْنَ لَهُمُ الْخِیَرَةُ مِنْ اَمْرِهِمْ ؕ وَ مَنْ یَّعْصِ اللّٰهَ وَ رَسُوْلَهٗ فَقَدْ ضَلَّ ضَلٰلًا مُّبِیْنًاؕ۝۳۶'
  '\nআর আল্লাহ এবং তাঁর রসূল যখন কোন বিষয়ে ফায়সালা করেন, তখন কোন মু’মিন নর ও মু’মিন নারীর তাদের নিজ বিষয়ে আর কোন অধিকার থাকে না। যে আল্লাহ এবং তাঁর রসূলের অবাধ্য হলো, সে সুস্পষ্ট ভ্রান্তিতে পড়ে গেল।[১৩]\n'
    'ۤاَیُّهَا الَّذِیْنَ اٰمَنُوْا لَا تُقَدِّمُوْا بَیْنَ یَدَیِ اللّٰهِ وَ رَسُوْلِهٖ وَ اتَّقُوا اللّٰهَ ؕ اِنَّ اللّٰهَ سَمِیْعٌ عَلِیْمٌ۝۱'
  '\nহে ঈমানদারগণ! তোমরা আল্লাহ ও তাঁর রসূলের আগে বেড়ে যেয়োনা আর আল্লাহ’কে ভয় করো। নিশ্চয়ই আল্লাহ শ্রবণকারী ও জ্ঞাত।[১৪]\n'
  'পূর্বোক্ত বিবরণ দ্বারা বুঝা গেল যে, সার্বভৌমত্বের মালিক একমাত্র আল্লাহ তা’আলা। তিনিই সার্বভৌম বা ইলাহ্। সকল কিছুর নেতৃত্ব, কর্তৃত্ব ও প্রভূত্ব তাঁরই। তিনি সর্বস্রষ্টা, সর্বকর্তা , সর্বশ্রোতা ও সর্বদ্রষ্টা।',
    description:' ',
    reference: ' ১. সূরা আল-ফাতিহাহ্: ১\n'
    '২. সূরা আয্-যুমার: ৬২\n'
  '৩. সূরা আর-রূম: ৪০\n'
  '৪. সূরা য়ূসুফ: ৪০\n'
  '৫. সূরা আল-বাকারাহ: ১০৭\n'
 ' ৬. সূরা আলি ইমরান: ১৮৯\n'
  '৭. সূরা আল-ফুরক্বন: ২\n'
  '৮. সূরা আর-র’দ: ১৬\n'
  '৯. সূরা আল-আনআম: ১৮\n'
 ' ১০. সূরা আল-আ’রফ: ৫৪\n'
  '১১.সূরা ইয়াসিন: ৮৩\n'
 ' ১২. সূরা আল-আম্বিয়া: ২৩\n'
  '১৩. সূরা আল-আহযাব: ৩৬\n'
  '১৪. সূরা আল-হুজুরত: ১ ',
  ),



  TextModel(
    title: 'মা’বূদ কাকে বলে',
    arabic_title: '',
    show: true,
    translation: '',
    description:' ',
    reference: ' ',
  ),
  TextModel(
    title: '',
    arabic_title: '',
    show: true,
    translation: '',
    description:' ',
    reference: ' ',
  ),
  TextModel(
    title: '',
    arabic_title: '',
    show: true,
    translation: '',
    description:' ',
    reference: ' ',
  ),
  TextModel(
    title: '',
    arabic_title: '',
    show: true,
    translation: '',
    description:' ',
    reference: ' ',
  ),
  TextModel(
    title: '',
    arabic_title: '',
    show: true,
    translation: '',
    description:' ',
    reference: ' ',
  ),
  TextModel(
    title: '',
    arabic_title: '',
    show: true,
    translation: '',
    description:' ',
    reference: ' ',
  ),
  TextModel(
    title: '',
    arabic_title: '',
    show: true,
    translation: '',
    description:' ',
    reference: ' ',
  ),
  TextModel(
    title: '',
    arabic_title: '',
    show: true,
    translation: '',
    description:' ',
    reference: ' ',
  ),
  TextModel(
    title: '',
    arabic_title: '',
    show: true,
    translation: '',
    description:' ',
    reference: ' ',
  ),
];